#+title:      A Klasse 2021-25
#+date:       [2022-12-28 Mi 20:51]
#+filetags:   :3a:Project:
#+identifier: 20221228T205119
#+STARTUP: showall
#+STARTUP: logdone
#+STARTUP: lognotedone
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/3a.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 3A [KV Bernhard Moser]
:PROPERTIES:
:CUSTOM_ID: h:93a698c2-00bf-4e63-90d0-788fd08fe19d
:END:

#+Name: 2021-students
| First    | Last         | Name                | Note | Heft | Mitarbeit | LZK |
|----------+--------------+---------------------+------+------+-----------+-----|
| Marie    | Aigner       | [[Marie Aigner][Marie Aigner]]        |      |      |         1 |     |
| Marko    | Bijelonjic   | [[Marko Bijelonjic][Marko Bijelonjic]]    |      |      |         1 |     |
| Sarah    | Brandstätter | [[Sarah Brandstätter][Sarah Brandstätter]]  |      |      |         1 |     |
| Julia    | Bretschu     | [[Julia Bretschu][Julia Bretschu]]      |      |      |         0 |     |
| Matteo   | Eckhardt     | [[Matteo Eckhardt][Matteo Eckhardt]]     |      |      |         1 |     |
| Diana    | Eibl         | [[Diana Eibl][Diana Eibl]]          |      |      |         1 |     |
| *Oliver  | Kurz         | [[Oliver Kurz][Oliver Kurz]]         |      |      |         2 |     |
| Elisa    | Mayr         | [[Elisa Mayr][Elisa Mayr]]          |      |      |         1 |     |
| Alisa    | Meisl        | [[Alisa Meisl][Alisa Meisl]]         |      |      |         1 |     |
| Carolina | Schlager     | [[Carolina Schlager][Carolina Schlager]]   |      |      |         1 |     |
| Marie    | Schmidt      | [[Marie Schmidt][Marie Schmidt]]       |      |      |         1 |     |
| Annika   | Schröcker    | [[Annika Schröcker][Annika Schröcker]]    |      |      |         1 |     |
| Lea      | Stoß         | [[Lea Stoß][Lea Stoß]]            |      |      |         1 |     |
| Manuel   | Stoß         | [[Manuel Stoß][Manuel Stoß]]         |      |      |         1 |     |
| Johanna  | Strubreiter  | [[Johanna Strubreiter][Johanna Strubreiter]] |      |      |         1 |     |
| Laurenz  | Walcher      | [[Laurenz Walcher][Laurenz Walcher]]     |      |      |         0 |     |
| Lorenz   | Wallinger    | [[Lorenz Wallinger][Lorenz Wallinger]]    |      |      |         2 |     |
| Jana     | Wenger       | [[Jana Wenger][Jana Wenger]]         |      |      |         1 |     |
| Luca     | Zemmer       | [[Luca Zemmer][Luca Zemmer]]         |      |      |         2 |     |
| Karlo    | Zivkovic     | [[Karlo Zivkovic][Karlo Zivkovic]]      |      |      |         2 |     |
| Robert   | Zivkovic     | [[Robert Zivkovic][Robert Zivkovic]]     |      |      |         1 |     |
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $6='(identity remote(Mitarbeit,@@#$2)) 

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: ' + first + '' + last + '')
      print('|-------+-------+------+---------|')
      print('| Datum | Topic | Note | Notizen |')
      print('|-------+-------+------+---------|')
      print('\n')
      print('*** Note ' + first + ' ' + last + '')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
* Mitarbeittabelle
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|---------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Marie Aigner][Marie Aigner]]        |    1 | 1 | 2 | 2 | 1 | 1 | 1 | 2 | 1 | 1 |  2 |
| [[Marko Bijelonjic][Marko Bijelonjic]]    |    1 | 1 | 2 | 1 | 1 | 2 | 1 | 1 | 2 | 1 |  2 |
| [[Sarah Brandstätter][Sarah Brandstätter]]  |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Julia Bretschu][Julia Bretschu]]      |    0 |   |   |   |   |   |   |   |   |   |    |
| [[Matteo Eckhardt][Matteo Eckhardt]]     |    1 | 2 | 1 | 2 | 1 | 1 | 2 | 1 | 1 | 2 |  1 |
| [[Diana Eibl][Diana Eibl]]          |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Oliver Kurz][Oliver Kurz]]         |    2 | 2 | 2 | 2 | 1 | 2 | 1 | 2 | 1 | 2 |  1 |
| [[Elisa Mayr][Elisa Mayr]]          |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Alisa Meisl][Alisa Meisl]]         |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Carolina Schlager][Carolina Schlager]]   |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Marie Schmidt][Marie Schmidt]]       |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Annika Schröcker][Annika Schröcker]]    |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Lea Stoß][Lea Stoß]]            |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Manuel Stoß][Manuel Stoß]]         |    1 | 2 | 1 | 2 | 1 | 1 | 1 | 2 | 1 | 1 |  1 |
| [[Johanna Strubreiter][Johanna Strubreiter]] |    1 | 1 | 1 | 1 | 2 | 2 | 1 | 2 | 2 | 1 |  1 |
| [[Laurenz Walcher][Laurenz Walcher]]     |    0 |   |   |   |   |   |   |   |   |   |    |
| [[Lorenz Wallinger][Lorenz Wallinger]]    |    2 | 2 | 2 | 2 | 1 | 2 | 2 | 1 | 2 | 1 |  2 |
| [[Jana Wenger][Jana Wenger]]         |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
| [[Luca Zemmer][Luca Zemmer]]         |    2 | 2 | 1 | 2 | 2 | 1 | 1 | 2 | 1 | 1 |  2 |
| [[Karlo Zivkovic][Karlo Zivkovic]]      |    2 | 2 | 2 | 2 | 1 | 1 | 1 | 2 | 1 | 2 |  1 |
| [[Robert Zivkovic][Robert Zivkovic]]     |    1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |  1 |
#+TBLFM: $2=vmean($3..$>);%.0f
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

